art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE (id IN ([#<Artwork id: 4>, #<ArtworkShare id: nil, artwork_id: 4>]))
---
  def index
    # artworks = Artwork.all
    # artwork_ids = Artwork.select(:id).where(artist_id: params[:user_id]).id + ArtworkShare.select(:artwork_id).where(viewer_id: params[:user_id])

    ids = Artwork.where(artist_id: params[:user_id]).ids + ArtworkShare.where(viewer_id: params[:user_id]).pluck(:artwork_id)
    artworks = Artwork.where("id IN (#{ids})")

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Fingernails on Chalkboard"], ["image_url", "hateu.com"], ["artist_id", 7], ["created_at", "2019-04-09 20:41:31.929391"], ["updated_at", "2019-04-09 20:41:31.929391"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    artwork = Artwork.find(params[:id])