art_share_api/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 8], ["created_at", "2019-04-09 22:13:59.045350"], ["updated_at", "2019-04-09 22:13:59.045350"]]
---
  def create
    share = ArtworkShare.new(artwork_share_params)

    if share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]
---
  def destroy
    share = ArtworkShare.find(params[:id])
    share.destroy