art_share_api/app/controllers/users_controller.rb

  def index
    render json: User.all
---
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rocky"], ["email", "rocky@kitty.com"], ["created_at", "2019-04-08 22:25:10.187856"], ["updated_at", "2019-04-08 22:25:10.187856"]]

  def show
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]